# BuiltInFailures.RevisionFailures Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..RevisionFailures Properties
BuiltInFailures..::..RevisionFailures Class See Also
---
The BuiltInFailures..::..RevisionFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RevisionSettingsDuplicateName | More than one Revisons have the same name %1!s!. |

# See Also
BuiltInFailures..::..RevisionFailures Class
Autodesk.Revit.DB Namespace